Repository: sandeep1988/django-taimi-project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Taimi Hydraulics
pt: Taimi Hidráulica

source: Nouvelles
pt: Notícia

source: First name:
pt: Primeiro nome:

source: Last name:
pt: Sobrenome:

source: Subscribe
pt: Assinar

source: Invalid email!
pt: E-mail inválido!

source: Success!
pt: Sucesso!

source: Thank you for subscribing!
pt: Obrigado por subscrever!

source: An error has occured:
pt: Ocorreu um erro:

source: Produits
pt: Produtos

source: Product already in your information request
pt: Produto já no seu pedido de informação

source: Product successfully added to your information request, click <a href="/en/swivels/listinfo/">here</a> to see your request.
pt: Produto adicionado com sucesso ao seu pedido de informação, clique <a href="/pt/swivels/listinfo/"> aqui</a> para ver o seu pedido.

source: Product successfully removed from your information request
pt: Produtos removido com sucesso do seu pedido de informações

source: Calculator
pt: Calculadora

source: Testimonies List
pt: Testemunhos

source: Advantages of using Taimi products
pt: Vantagens de usar os produtos Taimi

source: Search
pt: Pesquisa

source: Information request
pt: Dúvidas

source: Quick links
pt: Atalhos

source: Newsletter
pt: Informativo

source: Subscribe to our newsletter and keep up to date 3 times a year with latest testimonies, promotions, innovations and news from Taimi Hydraulics.
pt: Assine nosso informativo e fique em dia, por três vezes ao ano, com os mais recentes testemunhos de clientes, novidades e inovações da Taimi Hidráulica.

source: Contact
pt: Contacto

source: Copyright
pt: Todos os direitor reservados

source: Creation of
pt: Desenvolvido por

source: About this calculator
pt: Sobre esta calculadora

source: Cost of swivels and hoses is based on average published list prices.
pt: O custo das juntas rotativas e das mangueiras é baseado na média dos preços publicados no mercado.

source: It is estimated that replacing a hose on logging equipment will cause a 15 minute downtime on average at $200, or €200 per hour.
pt: Estima-se que substituir uma mangueira de um equipamento de exploração florestal cause em média 15 minutos de paralização, gerando um custo de $ 200 ou € 200 por hora.

source: It is estimated that 0.25 gallons of oil is lost every time a hose is replaced. Price of hydraulic oil is estimated at $15 per gallon, or €8 per litre.
pt: Estima-se que 0,25 galão de óleo é perdido a cada vez que uma mangueira é substituída. O preço do óleo hidráulico é considerado em $ 15 por galão ou € 8 por litro.

source: Cost of hose replacement due to twisting and wear is estimated at $0.50 or €0.50 per hose, per hour without swivels, and $.10, or €0.10 per hour,per hose with swivels.
pt: O custo de uma troca de mangueira devido a torção ou desgaste é estimado em $ 0,5 ou € 0,5 por mangueira, por hora, sem juntas rotativas. Com juntas rotativas, o valor vai para $ 0,1 ou € 0,1.

source: This calculator is only intended to help users understand how various hydraulic setups can increase or decrease operation costs.
pt: Esta calculadora pretende apenas ajudar usuários a compreenderem como diferentes configurações de seus aparelhos hidráulicos podem aumentar ou diminuir os custos de operação.

source: Results and actual savings may vary depending on: machine, operating pressure, operator, outside temperature and other factors.
pt: Resultados e reais economias podem variar dependendo do maquinário; da pressão de operação; do operador; da temperatura externa; e de outros fatores.

source: Catalogues and brochures
pt: Catálogos e Informativos

source: Click
pt: Clique

source: here
pt: aqui

source: to see our online version
pt: para ver nossa versão online.

source: Taimi 2014 Product Catalog
pt: Catálogo de Produtos Taimi 2014 (arquivo em inglês)

source: Brochures
pt: Informativos (arquivos em inglês)

source: Taimi 2013 Product Catalog
pt: Catálogo de Produtos Taimi 2013 (arquivo em inglês)

source: General Brochure
pt: Informações Gerais

source: Forestry Brochure
pt: Informações sobre Exploração Florestal

source: Taimi's Technology Explained
pt: Tecnologia Taimi em Detalhes

source: Swivel Comparison Chart
pt: Tabela Comparativa de Juntas Rotativas

source: Real Cost of Swivel Replacement
pt: Custo Real de Substituição de Juntas Rotativas

source: Hydraulic Solutions - Forestry Equipment
pt: Soluções Hidráulicas - Equipamentos de Exploração Florestal

source: Group and Support Hoses Efficiently
pt: Agrupe e Apoie as Mangueiras de Forma Eficiente

source: More Productive Drill Rigs
pt: Perfuratrizes mais Produtivas

source: Contact - Get in touch
pt: Entre em contato

source: Taimi Hydraulics administration
pt: Sede da Taimi Hidráulica

source: For any enquiry, give us a call or contact us by sending an email. We aim to respond to all online enquiries within one working day.
pt: Para qualquer questão, ligue ou nos mande um e-mail. Damos um prazo de um dia útil para responder quaisquer perguntas que forem enviadas.

source: Opening hours
pt: Horário de funcionamento

source: - Time Zone EST (UTC/GMT -5 hours)
pt: - Horário do leste (UTC/GMT – 5 horas)

source: Monday to Thursday : 8:00 AM - 4:30 PM
pt: Segunda a quinta-feira: das 8h00 às 16h30

source: Friday : 8:00 AM - 4:00 PM
pt: Sexta-feira: das 8h00 às 16h00

source: Saturday and Sunday: CLOSED
pt: Sábado e domingo: FECHADO

source: Please use the form below to send us an email.
pt: Favor utilizar o formulário abaixo para nos enviar um e-mail

source: Taimi pioneered the “Spike Protected” high pressure ball-less swivel technology and invented the swivel cartridge
pt: Taimi é pioneira na fabricação de juntas rotativas swivel de alta pressão sem rolamento esférico, usando a exclusiva tecnologia Spike Protection&trade; assim como foi a inventora do Cartucho Swivel.

source: Taimi is a manufacturer of leak-free long lasting swivel products designed to support today's pressure requirements.
pt: A Taimi fabrica juntas rotativas swivel de alta durabilidade, à prova de vazamentos, desenvolvidas para resistir a toda pressão requerida pelo maquinário atual.

source: Taimi works with users, distributors and equipment manufacturers to design innovative swivel products.
pt: A Taimi trabalha em colaboração com clientes, distribuidores e fabricantes de equipamentos para desenvolver juntas rotativas cada vez mais inovadoras.

source: Taimi Live Swivel Joints
pt: Juntas Rotativas (Swivel) Taimi

source: Featuring Taimi’s Pressure Spike Protection&trade;, the most reliable ball-less swivels on the market are designed to be leak resistant, endure heavy side load, high pull force and the high pressure and flow of modern equipment.
pt: Incluindo a tecnologia “Spike Protection” &trade; da Taimi, o mais confiável sistema de junta rotativa sem rolamento esférico do mercado, desenvolvida para ser à prova de vazamentos e suportar pesadas cargas colaterais (“side loads”), alta impulsão, alta pressão e o fluxo das máquinas modernas.

source: Learn More
pt: Saiba Mais

source: Innovative Swivel Products
pt: Produtos Swivel Inovadores

source: A range of unique and patented swivel products designed to increase hydraulic reliability of forestry, mining, transport and industrial equipment.
pt: Uma gama exclusiva de peças relacionadas às juntas rotativas Taimi, desenvolvida para aumentar a confiabilidade na operação hidráulica do maquinário empregado em atividades de exploração florestal, mineral, de transporte e industrial.

source: Your information request
pt: Seu pedido de informações

source: Part. #
pt: Nº da Peça

source: Category
pt: Categoria

source: Sub-Category
pt: Sub-Categoria

source: SEAL_KIT
pt: Kit de Selamento

source: Info. Request
pt: Dúvidas

source: Name
pt: Nome

source: required
pt: obrigatório

source: Email
pt: Seu endereço de e-mail

source: Country
pt: País

source: Postal Code
pt: Código Postal

source: Message
pt: Mensagem

source: Send Message
pt: Enviar Mensagem

source: No data available
pt: Nenhum dado disponível na tabela

source: Create an inquiry basket to get prices and information
pt: Criar uma cesta de inquérito para obter preços e informações

source: Got equipment using hydraulics and swivels?
pt: Você tem equipamento hidráulico com juntas rotativas (swivel)?

source: Reduce the costs of swivel replacement, increase hose life and increase your bottom line.
pt: Reduza o custo de substituição de juntas, aumente a vida útil de suas mangueiras e otimize seus resultados.

source: Taimi Swivels are the toughest out there. An independent lab test proved our years of field history results right: Taimi swivels will far outlast any other swivel on the market.
pt: As juntas rotativas Taimi são as mais resistentes do mercado. Um teste independente realizado em laboratório comprovou o que todos os nossos clientes já sabiam: as juntas Taimi duram mais que qualquer outra.

source: The cost of ownership of a Taimi swivel is the lowest compared to any other swivel. Acquisition cost, although higher, is not the most important part of the equation. Taimi swivels are the cheapest swivels &lsquo;by the hour&rsquo; on the market today.
pt: O custo de ciclo de vida (LCCA) de uma junta Taimi é o mais baixo comparado com qualquer outra disponível no mercado, mesmo que o valor de aquisição de uma Taimi seja por vezes mais elevado que a concorrência. Isso porque a Taimi é o melhor custo-benefício do mercado. As juntas Taimi são, definitivamente, as mais baratas “por hora de uso” atualmente disponíveis.

source: See how much you can save by switching to Taimi Swivels
pt: Veja o quanto você pode economizar mudando para as juntas Taimi.

source: Step 1
pt: 1º Passo

source: Equipment
pt: Equipamento

source: Step 2
pt: 2º Passo

source: Location
pt: Localização

source: Step 3
pt: 3º Passo

source: Step 4
pt: 4º Passo

source: Hours worked by years
pt: Horas trabalhadas por ano

source: Select your equipment
pt: Escolha seu equipamento

source: Harvester/Processor Head
pt: Colheitadeira Florestal / Terminal (Cabeça) de Processamento

source: High Rotation Disc Saw Felling Head
pt: Serra circular de alta rotação – Terminal (Cabeça) de corte

source: Other
pt: Outro

source: Select your location
pt: Escolha sua localização

source: America
pt: América (do Norte, Central ou Sul)

source: Europe
pt: Europa

source: What type of swivels do you currently use?
pt: Que tipo de junta rotativa você usa atualmente?

source: None
pt: Nenhuma

source: Ball Bearing Swivels
pt: Com rolamento

source: Heavy Duty Ball Bearing Swivels
pt: Com rolamento, para trabalhos pesados

source: I don’t know which type I’m using
pt: Eu não sei qual tipo eu uso

source: Enter hours worked per year
pt: Insira as horas de trabalho por ano

source: Hours worked by year:
pt: Horas de trabalho por ano

source: Click Calculate button to see how much you can save by switching to Taimi Swivels.
pt: Clique no botão “calcular” para ver quanto você pode economizar mudando para as juntas Taimi.

source: Next
pt: Próximo

source: Previous
pt: Voltar

source: Calculate
pt: Calcular

source: Get informations about our products, latest innovations and testimonies
pt: Informe-se sobre nossos produtos, últimas inovaçoes e testemunhos

source: by subscribing to our newletters :
pt: assinando nosso informativo:

source: We have distributors in <b>21 countries</b>. To locate the one nearest to you, please contact us.
pt: Nós temos distribuidores em <b>21 países</b>. Para localizar o mais próximo de você, por favor, entre em contato.

source: Live Swivels
pt: Juntas rotativas

source: Featuring Taimi's Pressure Spike Protection™, the most reliable ball-less swivels on the market are designed to be leak resistant, endure heavy side load, high pull force and the high pressure and flow of modern equipment.
pt: Incluindo a tecnologia “Spike Protection” ™ da Taimi, o mais confiável sistema de junta rotativa sem rolamento esférico do mercado, desenvolvida para ser à prova de vazamentos e suportar pesadas cargas colaterais, alta impulsão, alta pressão e o fluxo das máquinas modernas.

source: Inline swivels
pt: Junta Rotativa em Linha

source: Swivels Products
pt: Peças Swivel

source: A range of unique and patented swivel products designed to increase hydraulic reliability of forestry, mining, transport and industrial equipment.
pt: Uma gama exclusiva de peças relacionadas às juntas rotativas Taimi, desenvolvida para aumentar a confiabilidade na operação hidráulica do maquinário empregado em atividades de exploração florestal, mineral, de transporte e industrial.

source: See how much you could save by switching to Taimi swivels
pt: Veja o quanto você pode economizar mudando para as juntas Taimi.

source: Calculate your savings
pt: Calcule sua economia

source: Choose your type of
pt: Escolha o tipo de

source: Warranted 12 months
pt: Garantia de 12 meses

source: Why choose Taimi swivels
pt: Por que escolher as juntas rotativas Taimi

source: Better wear resistance
pt: Melhor resistência ao desgaste

source: Withstand high pressure
pt: Resiste a imensas pressões

source: Better side load resistance
pt: Melhor distribuição de carga colateral (“side load”)

source: Fewer hydraulic leaks
pt: Menos vazamentos

source: Easy maintenance
pt: Fácil manutenção

source: More on advantages
pt: Mais vantagens

source: Live Swivels and Swivel Products
pt: Produtos Swivel Inovadores

source: Videos
pt: Vídeos

source: Testimonies
pt: Testemunhos

source: Info request
pt: Dúvidas
